lab12/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test_user"], ["LIMIT", 1]]
---
  def create
    user_data = params[:user]
    user = User.find_by(username: user_data[:username])